<html>

  <head>
    <title>SEPA Dashboard v1.0</title>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="">
    <meta name="author" content="">
    <link rel="icon" href="../../favicon.ico">

    <!-- jquery -->
    <script src="jquery-3.2.1/jquery-3.2.1.min.js"></script>
    
    <!-- Latest compiled and minified CSS -->
    <link rel="stylesheet" href="bootstrap-3.3.7-dist/css/bootstrap.min.css">
    
    <!-- Latest compiled and minified JavaScript -->
    <script src="bootstrap-3.3.7-dist/js/bootstrap.min.js"></script>

    <!-- Sepa dashboard -->
    <script type="text/javascript" src="sepadashboard.js"></script>
    
  </head>

  <body>

    <!-- NAVBAR -->
    <nav class="navbar navbar-inverse">
      <div class="container">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
          <a class="navbar-brand" href="#">SEPAdiscover</a>
        </div>
        <div id="navbar" class="collapse navbar-collapse">
          <ul class="nav navbar-nav">
            <li class="active"><a href="#">Home</a></li>
            <li><a href="about.html">About</a></li>
          </ul>
        </div><!--/.nav-collapse -->
      </div>
    </nav>

    <!-- MAIN CONTAINER -->
    <div class="container">

      <!-- CONNECTION PARAMETERS -->
      <div class="panel panel-default">
	<div class="panel-heading">
	  JSAP File
	</div>
	<div class="panel-body">

	  <div class="row">
	    <div class="col-lg-6">
	      <div class="input-group">
		<input type="file" class="btn btn-default" id="loadJsap">
	      </div>
	    </div>
	    <div class="col-lg-6">
	      <div class="input-group">
		<button type="button" class="btn btn-default" id="loadJsapButton" onclick="javascript:loadJsap();">Load JSAP</button>
	      </div>
	    </div>
	  </div>
	</div>
      </div>

      
      <!-- CONNECTION PARAMETERS -->
      <div class="panel panel-default">
	<div class="panel-heading">
	  Connection Parameters
	</div>
	<div class="panel-body">
	  <div class="input-group input-group-sm">
	    <span class="input-group-addon" id="basic-addon1">Update URL</span>
	    <input type="text" class="form-control" placeholder="http://wot.arces.unibo.it:8000/update" aria-describedby="basic-addon1" id="updateUriInput">
	  </div>
	  <br>
	  <div class="input-group input-group-sm">
	    <span class="input-group-addon" id="basic-addon1">Query URL</span>
	    <input type="text" class="form-control" placeholder="http://wot.arces.unibo.it:8000/query" aria-describedby="basic-addon1" id="queryUriInput">
	  </div>
	  <br>
	  <div class="input-group input-group-sm">
	    <span class="input-group-addon" id="basic-addon1">Subscribe URL</span>
	    <input type="text" class="form-control" placeholder="ws://wot.arces.unibo.it:9000/subscribe" aria-describedby="basic-addon1" id="subscribeUriInput">
	  </div>
	</div>
      </div>

      <!-- NAMESPACES -->
      <div class="panel panel-default">
	<div class="panel-heading">Namespaces</div>
	<div class="panel-body">

	  <form class="form-inline small">
	    <div class="form-group">
	      <label>Prefix:</label>
	      <input type="text" class="form-control" id="prefixField">
	    </div>
	    <div class="form-group">
	      <label>Namespace:</label>
	      <input type="text" class="form-control" id="namespaceField">
	    </div>
	    <button type="button" class="btn btn-default" onclick="javascript:addNamespace();">Add</button>	    
	  </form>
	  
	  <table class="table table-bordered table-hover table-condensed small" id="namespacesTable">
	    <tr><th>Prefix</th><th>Namespace</th><th>Actions</th></tr>
	  </table>
	</div>
	</div>
	
	<!-- UPDATE -->
	<div class="panel panel-default" id="updatePanel">
	  <div class="panel-heading">Update</div>
	  <div class="panel-body">
	    
	    <form>
	      <div class="form-group">
		<label for="updateInput">SPARQL Update</label>
		<textarea class="form-control" id="updateTextInput"></textarea>
	      </div>
	      <button type="button" class="btn btn-default" onclick="javascript:update();">Submit</button>
	      <button type="button" class="btn btn-default" onclick="javascript:clr('update');">Clear</button>
	     </form>
	    
	  </div>
	  <div class="panel-footer" id="updatePanelFooter">
	  </div>
	</div>

	<!-- QUERY -->
	<div class="panel panel-default" id="queryPanel">
	  <div class="panel-heading">Query</div>
	  <div class="panel-body">

	     <form>
	       <div class="form-group">
		 <label for="queryInput">SPARQL Query</label>
		 <textarea class="form-control" id="queryTextInput">SELECT ?s ?p ?o WHERE { ?s ?p ?o }</textarea>
	       </div>
	       <button type="button" class="btn btn-default" onclick="javascript:query();">Submit</button>
	       <button type="button" class="btn btn-default" onclick="javascript:clr('query');">Clear</button>
	     </form>
	     
	    Results
	  <table class="table table-bordered table-hover table-condensed small" id="queryTable">
	  </table>
	  </div>
	  <div class="panel-footer" id="queryPanelFooter">	    
	  </div>
	</div>

	<!-- SUBSCRIPTION -->
	<div class="panel panel-default" id="subscribePanel">
	  <div class="panel-heading">Subscribe</div>
	  <div class="panel-body">
	    Active Subscriptions
	    <table class="table table-bordered table-hover table-condensed">
	      <tr><th>ID</th><th>Alias</th><th>Actions</th></tr>
	    </table>
	    Added Results
	    <table class="table table-bordered table-hover table-condensed">
	      <tr><th>?s</th><th>?p</th><th>?o</th></tr>
	    </table>
	    Deleted Results
	    <table class="table table-bordered table-hover table-condensed">
	      <tr><th>?s</th><th>?p</th><th>?o</th></tr>
	    </table>
	  </div>
	  <div class="panel-footer">
	  </div>
	</div>
	
    </div>
   
    <!-- Bootstrap core JavaScript
    ================================================== -->
    <!-- Placed at the end of the document so the pages load faster -->
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
    <script>window.jQuery || document.write('<script src="../../assets/js/vendor/jquery.min.js"><\/script>')</script>
    <script src="../../dist/js/bootstrap.min.js"></script>
    <script src="../../assets/js/ie10-viewport-bug-workaround.js"></script>
    
  </body>
    
</html>
